{
  "source": "ArXiv",
  "filename": "019_VirtualFab_From Talent Shortage to Workforce Excell.pdf",
  "domain": "VirtualFab",
  "total_chars": 97056,
  "total_chunks": 66,
  "chunks": [
    {
      "id": 13,
      "content": "e to fab-\nricate their own chips, so majority of U.S. semiconductor firms\nmaintain a fabless model. To keep up the pace, majority of\nU.S.-based semiconductor companies outsource their front-end\nand back-end manufacturing processing to overseas foundries\nfor wafer fabrication and Outsourced Semiconductor Assem-\nbly and Testing (OSATs) for Assembly/Testing/Packaging\n(ATP).",
      "size": 373,
      "sentences": 2,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 20,
      "content": "aguing the entire spectrum,\nstarting from a lack of technicians to design and operations\nengineers. This has alarming implications, as it keeps the U.S.\nfrom maintaining a secure manufacturing capacity in wafer\nfabrication and ATP, without a talented workforce driving\nit— which is paramount for innovating the next generation\nof semiconductor chips for advanced U.S. defense systems,\nautomated machinery, as well as quantum computing.",
      "size": 435,
      "sentences": 2,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 57,
      "content": "ries\nto perform malicious activities by tampering with the chips,\nsuch as through Trojan insertion. This presents a need for\nrigorous testing, assurance, and inspection standards to detect\nand classify defects and Trojans—which can be a mostly\nautomated process if embedded properly.",
      "size": 283,
      "sentences": 2,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 58,
      "content": "tect\nand classify defects and Trojans—which can be a mostly\nautomated process if embedded properly. Since a major target\nof the CHIPS Act is on chip design and wafer fabrication,\n\n=== Page 5 ===\nautomation in general can also garner support for increased\nfunding and investment towards a domestic advanced packag-\ning ecosystem since it reduces labor rates, increases supply\nchain security, and stimulates economic gains of equipment\nmanufacturers by establishing ATP facilities [9].",
      "size": 483,
      "sentences": 2,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 63,
      "content": "of job opportunities within the next\ncouple years [4], but there is not enough talent to fill them. The promising capabilities of automation and AR/VR, es-\npecially when used in parallel, increases workplace desir-\nability, decreases manufacturing defects, and optimizes defect\ndetection through recent advancements in AI/ML, ultimately\nmaximizing yields in production. Villani et al.",
      "size": 384,
      "sentences": 3,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 78,
      "content": "ding material tracking, equipment control,\nand product flow management to advanced process control. The benefits of automated metrology, decision-making, and\nanalysis extends onto faster time-to-data, increased productiv-\nity and throughput, as it presents in Industry 4.0. D. Industry 4.0’s Unique Paradigms\nIndustry 4.0 is characterized by full automation, intelligent\ntools with decision-making power, and big data analytics [15]\nto efficiently maximize productivity across the entire value\nchain.",
      "size": 500,
      "sentences": 3,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 83,
      "content": "id of digital twin\nmodeling, IoT, big data analytics, cloud computing, and\nartificial intelligence. With the current trajectory towards\nadvanced manufacturing, traditional data analysis and\nsynthesis techniques are projected to be overwhelmed by\nthe enormous datasets that come from complex industrial\nprocesses [18], such as in 300 mm wafer fabs, especially\nas time progresses with growing production demands.",
      "size": 410,
      "sentences": 2,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 84,
      "content": "[18], such as in 300 mm wafer fabs, especially\nas time progresses with growing production demands. • Operational Technology Domain - The OT serves\nto create a sustainable industrial operation/production\necosystem through effective management for maintenance\nof factories and creates a simpler interaction between\nemployees and industrial equipment/materials.",
      "size": 358,
      "sentences": 2,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 85,
      "content": "f factories and creates a simpler interaction between\nemployees and industrial equipment/materials. E. Industry 4.0 in the Semiconductor Industry\nAll three ubiquitous domains form the basis for four\npotential innovative solutions applicable towards the semi-\nconductor industry: AR/VR, remote servicing, Computer\nVision(CV)/ML enabled automated inspections, and predictive\nmaintenance, as illustrated in Figure 4. 1) AR/VR for remote planning and digital twin modeling.",
      "size": 469,
      "sentences": 3,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 86,
      "content": "ve\nmaintenance, as illustrated in Figure 4. 1) AR/VR for remote planning and digital twin modeling. Employees can congregate through the CT domain to\nlayout plans through AR/VR and visualize ideas, as well\nas exchange assistance. Furthermore, AR/VR can be used\nto simulate the 3D digital twin model of various fab\nscenarios for optimized production and reduce delays\nin congregating collaborative meetings through a virtual\nsetting.",
      "size": 432,
      "sentences": 4,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 90,
      "content": "acturing. The aim is to reduce time spent by\nworkers on diagnosing unexpected failures and repairs. 4) CV/ML enabled automated inspections to monitor\nproduction quality through analysis of visual data from\nthe production line to spot possible defects and faults. The trained algorithms can streamline failure analysis to\nensure maximum yield without needing manual quality\ninspection (which carries a higher chance of missed\ndefects due to human error).",
      "size": 453,
      "sentences": 4,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 91,
      "content": "ing manual quality\ninspection (which carries a higher chance of missed\ndefects due to human error). Adoption of this integrated framework offers multiple unique\nvenues that all play a crucial role in both front-end and\nback-end semiconductor manufacturing. Every century has\ncarried innovations from all scientific domains to develop\ntechnology to supplement human productivity,which serves to\noptimize yield and maximize efficiency.",
      "size": 433,
      "sentences": 3,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 94,
      "content": "is needed, especially as CHIPS Act fuels new\nfacilities and fabs constructions across the country. A talented\nworkforce is equipped with the skills to either design advanced\nchips through R&D or through monitoring fab operations to\nensure maximum production yield and quality, depending on\nwhich educational spectrum the individual is from.",
      "size": 340,
      "sentences": 2,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 107,
      "content": "of talent – from core to advanced pathway entries to the workforce [16], [20], [21]. presentations. Micron offers similar initiates such as the Chip\nCamp in select U.S. middle school districts, where students get\nto explore key processing steps in chip production (processing\nsilicon wafers, photolithography, etching, and ion implanting),\nvarious STEM activities, as well as receiving mentorship by\nboth Micron team members and engineering intern students.",
      "size": 457,
      "sentences": 3,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 111,
      "content": "ing,\nand upon graduation, they will be eligible to receive a full-\ntime technician role at Samsung. Engineering students also\nhave the opportunity to intern as a semiconductor engineering\nintern, a 3-month internship they are assigned a project in an\narray of areas such as analytics, automation, diffusion, etch,\nphotolithography, etc. with the opportunity to transition to a\nfull-time engineering position as well. B.",
      "size": 419,
      "sentences": 4,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 139,
      "content": "rough gamified simulations, done in parallel with ex-\nperiential learning in physical laboratories. Since current\nmicroelectronics training programs are faced with aging\nfaculty and a lack of state-of-the-art equipment for lab\noperations and design software, AR/VR simulations be\nleveraged to provide a realistic view to clean-room and\nfabrication equipment through training modules, which\nis a limited ability for many programs with physical\nlaboratories due to geographical barriers [2].",
      "size": 489,
      "sentences": 2,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 165,
      "content": "l Twin Modeling: Another dynamic implementa-\ntion is digital twin modeling for smart manufacturing. By recreating a physical system in a cyber realm, man-\nufacturers can realize potential optimizations, achieve a\ngreater increase in capacity, and maximize production\nefficiency without the risks associated in physical imple-\nmentation, which was applied successfully to layout fab\nplanning through the digital twin modeling and simula-\ntion of an automated 300mm Infineon Technologies fab\n[52].",
      "size": 495,
      "sentences": 2,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 166,
      "content": "gh the digital twin modeling and simula-\ntion of an automated 300mm Infineon Technologies fab\n[52]. Nevertheless, widespread adaptation of AR/VR within both\neducational and industrial domains is a complex process. Addressing these limitations necessitates a comprehensive\nframework according to each domain’s use standards, which\nis beyond the scope of this paper. VII. AUTOMATION: CURRENT CASE STUDIES AND\nFUTURE ROAD MAP\nA.",
      "size": 425,
      "sentences": 5,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 169,
      "content": "within any step of\nproduction can drastically affect the quality and yield. === Page 12 ===\nFig. 7. Applications of AR/VR\nHistorically, front-end operations within 200mm fabs were\nmanually handled by clean room technicians, such as material\ntransportation, which affected production throughput due to\nmore human error and higher risk of contamination during\nwafer processing—this was replaced by the AMHS, which\nreasonably reduced human action during manufacturing, as\nwell as advanced process control, and production planning.",
      "size": 527,
      "sentences": 4,
      "keyword_count": 5,
      "is_relevant": true
    },
    {
      "id": 170,
      "content": "ed human action during manufacturing, as\nwell as advanced process control, and production planning. As a result, current fabs are highly automated up to Industry\n3.0 level. Despite the evolved techniques of Industry 4.0, the semi-\nconductor sectors, specifically back-end manufacturing ATP,\ndo not fully harness the power of smart manufacturing, which\nrestricts the valuable time of existing workers spent towards\nmanual and repetitive tasks.",
      "size": 442,
      "sentences": 3,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 172,
      "content": ", as automation tools\nstreamline time-consuming processing, assembly, and quality\ncontrol flow [8]. The SEMI Foundation [54] provides a spectrum that\npresents the progressing stages of automation for fabs, from\nlevel 0 (zero automation) to level 5 (full automation). Level\n1 and 2 consists of Industry 3.0 techniques. For level 1,\nit consists of AMHS, defect control for yield tracking, and\nlimited preventative maintenance, all of which aid the oper-\nator at a subsystem level.",
      "size": 478,
      "sentences": 4,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 173,
      "content": "acking, and\nlimited preventative maintenance, all of which aid the oper-\nator at a subsystem level. Advanced Process Control (APC)\nis introduced at level 2, which involves Run-to-Run (R2R)\nprocessing and Fault Defect Classification (FDC). Broader\nIndustry 4.0 applications, such as AI/ML, are introduced\nin level 3 to provide conditional automation, in providing\npreventative maintenance techniques and digital twin modeling\non cloud-based platforms.",
      "size": 450,
      "sentences": 3,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 181,
      "content": "storage base for cloud manufacturing\nservices such as product design and testing simulations [56]. Large datasets of critical processing information is collected\nand analyzed by an ML algorithm to derive hidden patterns\n[57])\nA particular use case within front-end manufacturing is\nAutomated Visual Inspection (AVI) of wafers aims to reduce\nmanual labor spent on quality control while increasing produc-\ntion yield.",
      "size": 415,
      "sentences": 2,
      "keyword_count": 4,
      "is_relevant": true
    },
    {
      "id": 182,
      "content": "of wafers aims to reduce\nmanual labor spent on quality control while increasing produc-\ntion yield. The general procedure of AVI consists of inspecting\nthe device by sensors and processing the collected data through\nmultitude of CV or ML techniques, which provides feedback\nthroughout manufacturing flow for further optimization [58].",
      "size": 334,
      "sentences": 2,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 183,
      "content": "ML techniques, which provides feedback\nthroughout manufacturing flow for further optimization [58]. Any detected abnormalities notify the quality or process\nengineer in-charge for further fault assessment, only if a\nback-up Out-of-Control Action Plan is not implemented to\nautomatically halt the operation to prevent potential yield loss\n[59]. As a result, this eliminated the need for manual data\ntracking and analysis.",
      "size": 420,
      "sentences": 3,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 184,
      "content": "ntial yield loss\n[59]. As a result, this eliminated the need for manual data\ntracking and analysis. 1) Wafer Quality Control: In regards to automating quality\ncontrol during semiconductor manufacturing, Azamfar et al.",
      "size": 217,
      "sentences": 3,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 185,
      "content": "ontrol: In regards to automating quality\ncontrol during semiconductor manufacturing, Azamfar et al. [60] proposes an adaptable deep learning algorithm that’s\napplicable to a wide range of manufacturing settings that\nemploy varying operating conditions, so it offers a generalized\nfault detection mechanism to monitor optimal wafer quality,\nas experimental dataset is obtained from actual semiconductor\nmanufacturing. Using this method allows for predicting the\n\n=== Page 13 ===\nFig. 8.",
      "size": 485,
      "sentences": 4,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 186,
      "content": "l semiconductor\nmanufacturing. Using this method allows for predicting the\n\n=== Page 13 ===\nFig. 8. Industry perspective from experts on using VR for training\nquality of wafers without tedious manual inspection, ulti-\nmately reducing human intervention in quality control of fab\nprocesses.",
      "size": 289,
      "sentences": 4,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 187,
      "content": "us manual inspection, ulti-\nmately reducing human intervention in quality control of fab\nprocesses. Since deep learning algorithms require supervised\ntraining using enormous datasets to ensure a well-trained\nmodel, the same prototype can’t be carried onto the man-\nufacturing industry as it is not feasible to maintain such\nlarge database of labeled data that also accounts for varying\noperating conditions when considering the non-linear nature of\nmanufacturing.",
      "size": 463,
      "sentences": 2,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 189,
      "content": "ed model was tested with an unlabeled target\ndata that’s also captured from various sensor sources. The\nmodel performance is evaluated using datasets obtained during\nreal etching process in wafer processing, which produced fa-\nvorable outcomes in demonstrating a generalized deep learning\nmodel that’s applicable for all scenarios in manufacturing.",
      "size": 348,
      "sentences": 2,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 190,
      "content": "monstrating a generalized deep learning\nmodel that’s applicable for all scenarios in manufacturing. The ultimate goal is to lower reliance on human expertise\nand lessen manual inspection, which also lowers risk of\nhuman error and increases worker efficiency by automating\na repetitive task for process engineers [60]. Defects occurring in semiconductor devices take on a va-\nriety of visual shapes and textures as the fabrication process\nis highly complex.",
      "size": 456,
      "sentences": 3,
      "keyword_count": 4,
      "is_relevant": true
    },
    {
      "id": 191,
      "content": "ces take on a va-\nriety of visual shapes and textures as the fabrication process\nis highly complex. As a result, manual inspection technique\nand classification remains dependent on the background of the\nexperts performing the inspects. Imoto et al. [61] introduces\na CNN-based transfer learning method for automatic defect\nclassification that overcomes any ambiguity associated with\nmanual classification, by assisting engineers in their tasks.",
      "size": 444,
      "sentences": 4,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 193,
      "content": "training data, which is not feasible\nin large-scale manufacturing and various design IPs involved. Transfer learning serves as a solution to this issue through\nre-use of previous learned tasks on a limited database. At\nan actual manufacturing site, wafer surface SEM images of\n\n=== Page 14 ===\nvarious defects were sampled for performance assessment. As a result, the labor for manual inspection was reduced by\napproximately 2/3 compared to commercially-used automatic\ndefect classification methods.",
      "size": 499,
      "sentences": 4,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 194,
      "content": "reduced by\napproximately 2/3 compared to commercially-used automatic\ndefect classification methods. 2) AI-Controlled Real-Time Cluster Tool Scheduler for\nWafer Processing: Cluster tools are an automated manufactur-\ning mechanism that consists of multiple computer-controlled\nprocess units, a wafer-handling robot, and loadlocks (LLs)\nfor loading and unloading wafers, as a part of the wafer\nfabrication process [62].",
      "size": 416,
      "sentences": 2,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 195,
      "content": "loadlocks (LLs)\nfor loading and unloading wafers, as a part of the wafer\nfabrication process [62]. It allows for reducing the number\nof equipment needed in wafer processing steps by implement-\ning various process chambers with the same recipe on one\nplatform. Various wafer recipes rotating through the chamber\non different sequences, combined with the overall non-linearity\nof the manufacturing process, raises the processing complexity\nand inefficiency. Suerich et al.",
      "size": 470,
      "sentences": 4,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 200,
      "content": "Cs and PCBs remain cases\nwhere the potential of intelligent mechanism is yet to be\nfully leveraged. Traditional inspections techniques have relied\non human input to validate and check electronic components\nfor both defects and malicious tampering, which is a time-\nconsuming process prone to human error as the dataset be-\ncomes larger [64].",
      "size": 341,
      "sentences": 2,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 205,
      "content": "d streamline\nthe repetitive task of technicians and engineers involved in\nmanufacturing lines [65]. Optical inspection remains the gold standard for detecting\nany external or internal abnormalities for quality control in\npart of minimizing yield loss, as it is versatile for all types\nof electric components without needing destructive sample\npreparation.",
      "size": 355,
      "sentences": 2,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 206,
      "content": "t is versatile for all types\nof electric components without needing destructive sample\npreparation. Defect classification of cross-sectional images\nobtained from optical, x-ray, or SEM tools is an arduous task\nwhen done manually and necessitate use of virtual metrology\nand advanced defect classification algorithms.",
      "size": 316,
      "sentences": 2,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 207,
      "content": "ne manually and necessitate use of virtual metrology\nand advanced defect classification algorithms. Additionally,\nminiaturized features in recent nodes may result in noisier\nimages being produced, thus leaving failure analysis heavily\ndependent on SME input without extensive image processing\ntechniques.",
      "size": 304,
      "sentences": 2,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 208,
      "content": "ving failure analysis heavily\ndependent on SME input without extensive image processing\ntechniques. However, rapid progressions in machine learning\nalgorithms have allowed for image recognition to become an\nautomated task [66], particularly with the advances in ML,\nparticularly CNN, a subset of Deep-Learning Neural Network\n(DNN), designed for processing high volumes of data. Since\ndefect detection is highly complex process, CV solutions alone\ncannot provide full assurance.",
      "size": 477,
      "sentences": 3,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 209,
      "content": "Since\ndefect detection is highly complex process, CV solutions alone\ncannot provide full assurance. Subsequently, optical inspection\nsolutions are scaling towards ML/DL methods for a reconfig-\nurable approach to failure analysis, which also reduce the need\nfor preprocessing the image [67], [68].",
      "size": 296,
      "sentences": 2,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 210,
      "content": "le approach to failure analysis, which also reduce the need\nfor preprocessing the image [67], [68]. Both techniques can\nbe combined with traditional CV algorithms to complement\nnewer ML-based techniques by extracting parametric features\nto reduce the amount of data needed to achieve high accuracy\nwhen training ML models [64]. This reduces the burden\non fab engineers that utilize defect information to optimize\nproduction lines [69].",
      "size": 435,
      "sentences": 3,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 211,
      "content": "uces the burden\non fab engineers that utilize defect information to optimize\nproduction lines [69]. • Automated Via Detection for PCBs: While this case\nstudy’s main focus is on Printed Circuit Board (PCB) as-\nsurance, IC chips constitute a major part of any electronic\nsystem within a PCB, and both chips and PCBs happen\nto be the most counterfeited component as a result of\noutsourced manufacturing [70].",
      "size": 405,
      "sentences": 2,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 215,
      "content": "alse-positive via detection. The results were confirmed using a deep learning CNN-\nbased algorithm. The aim of the study was to present an\nautomated non-destructive reverse engineering techniques\nthat minimizes human intervention for validation and\nverification of hardware boards. • Isolating IC TSV Defects:\n– Kim et al.",
      "size": 322,
      "sentences": 4,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 217,
      "content": "fication in 3D-ICs\nthrough comprehensive analysis in feature extraction\nand pattern identification. The methodology con-\nsisted of training the CNN model with a dataset\nof TSV defect images from x-ray microscopy and\nSEM, which outperformed traditional image pro-\ncessing techniques by reducing human dependance\nthroughout the process by as much as 78.6%, but\nnevertheless requires a sharper classification accu-\nracy for size-dependent classification if it is to be\ndeployed in fab testing and packaging processes.",
      "size": 514,
      "sentences": 2,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 218,
      "content": "y for size-dependent classification if it is to be\ndeployed in fab testing and packaging processes. – Wolz et al. [73] presents a more detailed view into\nusing x-ray microscopy and deep learning algorithms\nfor precise isolation of wall delamination defects in\nmicrometer-sized Cu-lined TSVs with a low depth-\nto-diameter ratio, to be used in quality control and\nprocess efficiency within R&D settings.",
      "size": 401,
      "sentences": 3,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 224,
      "content": "the A-scan\nmode through a CNN algorithm, which outperformed\nother models in precise classification. While further optimization of the current model’s accu-\nracy and algorithm is needed to achieve full-scale industry\nuse, this proposed model resulted in a favorable outcome\nin automating defect detection for maximum production\nyield through locating and eliminating a variety of faults\nwhile minimizing human expertise in signal interpreta-\ntion.",
      "size": 446,
      "sentences": 2,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 228,
      "content": "empha-\nsizing the significance of screening defective IPDs before\ntheir installation. Chuang et al. [77] proposed a machine\nlearning-based screening method to detect faulty IPD,\nspecifically capacitors with potential reliability issues. Using parametric data gathered from 360,000 integrated\npassive devices (IPDs) during the wafer probing test, their\ndeveloped ML model’s primary objective is identifying\nIPDs with low breakdown voltage, which signifies re-\nduced reliability.",
      "size": 477,
      "sentences": 4,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 234,
      "content": "n facilitates the development of ML models,\neffectively harnessing the power of the collected data. Numerous prominent global enterprises have successfully\nemployed these capabilities in semiconductor fabs, ad-\nvanced packaging, fiber optics for transceivers, and pre-\n\n=== Page 16 ===\ncision placement for Surface Mount Technology (SMT). Remarkable enhancements have been observed, including\nimproved alignment accuracy, increased process yield,\nreduced cycle time, and minimized machine downtime.",
      "size": 498,
      "sentences": 3,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 235,
      "content": "ed alignment accuracy, increased process yield,\nreduced cycle time, and minimized machine downtime. Using automated data acquisition and analysis with\nAI/ML will effectively minimize the human expertise\nto detect and predicts faults manually. As semiconduc-\ntor packaging continues evolving and becoming more\ncomplex, there are future scopes for the researcher to\nimprove automation and optimization of semiconductor\nmanufacturing to solve the reliability problem.",
      "size": 464,
      "sentences": 3,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 241,
      "content": "r in thermal\ncharacterization of packaging, which ultimately decreases\nrisk of human error as well. • ML-based Classifiers for Predicting IC Yield in 3D\nPackaging: ML algorithms can be used to predict results\nof final package device tests, with the goal of spotting\nbad dies coming from front-end fabs before they are\npackaged, using dataset obtained from early stage wafer\nfabrication testing for each production unit.",
      "size": 419,
      "sentences": 2,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 242,
      "content": "ckaged, using dataset obtained from early stage wafer\nfabrication testing for each production unit. This is espe-\ncially critical for 3D IC packaging devices, where one bad\ndie means the whole package fails. As a result, this leads\nto profit loss and puts extra burden on packaging engi-\nneers. Chen et al.",
      "size": 306,
      "sentences": 4,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 247,
      "content": "s in automation and AR/VR, which are\ncurrently not fully leveraged by the semiconductor indus-\ntry. The developed future roadmaps paved the way for en-\nhanced education, training, and employee experience through\nAR/VR as well as future streamlining of manufacturing pro-\ncesses through preventative/predictive maintenance, automated\nwafer/die quality control, and inspection of IC packaging for\nhardware assurance.",
      "size": 414,
      "sentences": 2,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 248,
      "content": "enance, automated\nwafer/die quality control, and inspection of IC packaging for\nhardware assurance. Ultimately, this ensures a secure supply\nchain that upholds the U.S. in the global chip race amid\nthe ongoing talent gap by employing the innovative potential\nof Industry 4.0 smart manufacturing.",
      "size": 295,
      "sentences": 2,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 273,
      "content": "cheduling,” in 2021 22nd IEEE International\nConference on Industrial Technology (ICIT). IEEE, 2021. [31] T. Nakazawa and D. V. Kulkarni, “Anomaly detection and segmentation\nfor wafer defect patterns using deep convolutional encoder–decoder\nneural network architectures in semiconductor manufacturing,” IEEE\nTrans. Semicond. Manuf., vol. 32, no. 2, pp. 250–256, 2019.",
      "size": 366,
      "sentences": 8,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 275,
      "content": "aterial handling system capability,” IEEE Trans. Semicond. Manuf.,\nvol. 33, no. 1, pp. 13–22, 2020. [33] U. Batool, M. I. Shapiai, M. Tahir, Z. H. Ismail, N. J. Zakaria, and\nA. Elfakharany, “A systematic review of deep learning for silicon wafer\ndefect recognition,” IEEE Access, vol. 9, pp. 116 572–116 593, 2021.",
      "size": 314,
      "sentences": 9,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 276,
      "content": "eep learning for silicon wafer\ndefect recognition,” IEEE Access, vol. 9, pp. 116 572–116 593, 2021. [34] Y. Lu, C. Sun, X. Li, and L. Cheng, “Defect detection of integrated\ncircuit based on YOLOv5,” in 2022 IEEE 2nd International Conference\non Computer Communication and Artificial Intelligence (CCAI). IEEE,\n2022.",
      "size": 314,
      "sentences": 5,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 277,
      "content": "International Conference\non Computer Communication and Artificial Intelligence (CCAI). IEEE,\n2022. [35] F. Adly, P. D. Yoo, S. Muhaidat, and Y. Al-Hammadi, “Machine-\nlearning-based identification of defect patterns in semiconductor wafer\nmaps: An overview and proposal,” in 2014 IEEE International Parallel\n& Distributed Processing Symposium Workshops. IEEE, 2014. [36] Y.-C. Hsu, J.-T. Wang, and W.-S. Huang, “Upon human’s unknown, can\nAI help to address uncertainty?",
      "size": 468,
      "sentences": 5,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 279,
      "content": "7] Y. Ma, F. Wang, Q. Xie, L. Hong, J. Mellmann, Y. Sun, S. Gao,\nS. Singh, P. Venkatachalam, and J. Word, “Machine learning based\nwafer defect detection,” in Design-Process-Technology Co-optimization\nfor Manufacturability XIII, J. P. Cain and C.-M. Yuan, Eds. SPIE,\n2019. [38] J. Richter and D. Streitferdt, “Modern architecture for deep learning-\nbased automatic optical inspection,” in 2019 IEEE 43rd Annual Com-\nputer Software and Applications Conference (COMPSAC). IEEE, 2019.",
      "size": 480,
      "sentences": 6,
      "keyword_count": 6,
      "is_relevant": true
    },
    {
      "id": 280,
      "content": "n,” in 2019 IEEE 43rd Annual Com-\nputer Software and Applications Conference (COMPSAC). IEEE, 2019. [39] S. Ghosh, M. A. M. Sathiaseelan, and N. Asadizanjani, “Deep learning-\nbased approaches for text recognition in PCB optical inspection: A\nsurvey,” in 2021 IEEE Physical Assurance and Inspection of Electronics\n(PAINE). IEEE, 2021. [40] D. Mehta, J.",
      "size": 351,
      "sentences": 5,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 294,
      "content": "f things (amcot)—a smart manufacturing platform,” IEEE Robotics and\nAutomation Letters, vol. 2, pp. 1809–1816, 2017. [57] M. Khakifirooz, C. F. Chien, and Y.-J. Chen, “Bayesian inference for\nmining semiconductor manufacturing big data for yield enhancement\nand smart production to empower industry 4.0,” Appl. Soft Comput.,\nvol. 68, pp. 990–999, 2017. [58] S.-H. Huang and Y.-C. Pan, “Automated visual inspection in the semi-\nconductor industry: A survey,” Comput. Ind., vol. 66, pp. 1–10, 2015.",
      "size": 495,
      "sentences": 12,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 295,
      "content": "isual inspection in the semi-\nconductor industry: A survey,” Comput. Ind., vol. 66, pp. 1–10, 2015. [59] P. Barar, K. K. Gan, and J. Lee, “Taking engineering automation to the\nnext level with artificial intelligence,” 2020 International Symposium on\nSemiconductor Manufacturing (ISSM), pp. 1–4, 2020. [60] M. Azamfar, X. Li, and J. Lee, “Deep learning-based domain adaptation\nmethod for fault diagnosis in semiconductor manufacturing,” IEEE\nTransactions on Semiconductor Manufacturing, vol. 33, pp.",
      "size": 498,
      "sentences": 8,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 300,
      "content": "rnational Symposium on the Physical and\nFailure Analysis of Integrated Circuits (IPFA). IEEE, 2021. [66] L. H. d. S. Silva, G. O. d. A. Azevedo, B. J. T. Fernandes, B. L. D.\nBezerra, E. B. Lima, and S. C. Oliveira, “Automatic optical inspection\nfor defective PCB detection using transfer learning,” in 2019 IEEE Latin\nAmerican Conference on Computational Intelligence (LA-CCI). IEEE,\n2019.",
      "size": 389,
      "sentences": 4,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 302,
      "content": "Damon L and\nAsadizanjani, Navid, “FPIC: A novel semantic dataset for optical PCB\nassurance,” 2022. [68] X. Yang, F. Dong, F. Liang, and G. Zhang, “Chip defect detection based\non deep learning method,” in 2021 IEEE International Conference on\nPower Electronics, Computer Applications (ICPECA). IEEE, 2021. [69] L.\nPeters,\n“Improving\nyield\nwith\nmachine\nlearning,”\nhttps://semiengineering.com/improving-yield-with-machine-learning/,\nJul. 2022, accessed: 2023-7-27.",
      "size": 461,
      "sentences": 5,
      "keyword_count": 3,
      "is_relevant": true
    },
    {
      "id": 309,
      "content": "l and Multi-Physics Simulation and Experiments in\nMicroelectronics and Microsystems, pp. 1–4, 2015. [76] A. S. Nair, P. Hoffrogge, P. Czurratis, E. Kuehnicke, and M. Wolf,\n“Automated defect classification in semiconductor devices using deep\nlearning networks,” 2022 IEEE International Symposium on the Physical\nand Failure Analysis of Integrated Circuits (IPFA), pp. 1–8, 2022. [77] C.-H. Chuang, K.-W. Hou, C.-W. Wu, M. Lee, C.-H. Tsai, H. Chen, and\nM.-J.",
      "size": 456,
      "sentences": 5,
      "keyword_count": 2,
      "is_relevant": true
    },
    {
      "id": 313,
      "content": "tive thermal\nconductivity of semiconductor package,” IEEE Access, vol. 10, pp. 51 995–52 007, 2022. [81] H. Chen and D. Boning, “Online and incremental machine learning\napproaches for IC yield improvement,” in 2017 IEEE/ACM International\nConference on Computer-Aided Design (ICCAD). IEEE, 2017.",
      "size": 294,
      "sentences": 5,
      "keyword_count": 2,
      "is_relevant": true
    }
  ]
}